# -9999break

Последовательность. 
Вывести последовательность чисел, поступившую на вход.

Входные данные:
На вход программы поступает последовательность целых чисел. Количество чисел в последовательности заранее неизвестно, но зато известно, что в конце последовательности записано число -9999 и в последовательности всегда есть хотя бы одно число.

Выходные данные: 
Вывести все элементы последовательности, кроме заключительного -9999, на экран.


int main () {

  int a = 0;

  do
  {
    scanf ("%d", &a);
    if (a==-9999)
    {
      break;
    }
    printf("%d ", a);
  } while ( a != -9999);
  
  printf ("");
  
    return 0;
}
